In [2]:
import pandas
pandas.__version__

'1.0.5'

In [1]:
import numpy as np
import pandas as pd

In [2]:
count= pd.Series([600,800,700])
count

0    600
1    800
2    700
dtype: int64

In [3]:
count.values

array([600, 800, 700], dtype=int64)

In [4]:
count.index

RangeIndex(start=0, stop=3, step=1)

In [10]:
biryani = pd.Series([600,800,700], 
    index=['Chicken', 'Mutton', 'Prawns'])

biryani

Chicken    600
Mutton     800
Prawns     700
dtype: int64

In [11]:
biryani['Prawns']

700

In [12]:
biryani[0]

600

In [13]:
biryani.name='Fish'
biryani.index.name='Menu'
biryani

Menu
Chicken    600
Mutton     800
Prawns     700
Name: Fish, dtype: int64

In [14]:
np.log(biryani)

Menu
Chicken    6.396930
Mutton     6.684612
Prawns     6.551080
Name: Fish, dtype: float64

In [16]:
biryani[biryani>1000]

Series([], Name: Fish, dtype: int64)

In [17]:
biryani_dict = {'Chicken': 550, 'Mutton': 950, 'Prawns': 850, 'Paneer': 115}
print(biryani_dict)
pd.Series(biryani_dict)

{'Chicken': 550, 'Mutton': 950, 'Prawns': 850, 'Paneer': 115}

Chicken    550
Mutton     950
Prawns     850
Paneer     115
dtype: int64

In [25]:
data={"India":["Test","T20","WC"],
     "Year":[2019,2017,2018],
     "Bestscore":[626,260,413]}
print(data)
data=pd.DataFrame(data)
data

{'India': ['Test', 'T20', 'WC'], 'Year': [2019, 2017, 2018], 'Bestscore': [626, 260, 413]}

  India  Year  Bestscore
0  Test  2019        626
1   T20  2017        260
2    WC  2018        413

In [26]:
df = pd.DataFrame(data, columns=["Bestscore", "India" ,"Year"])
df

   Bestscore India  Year
0        626  Test  2019
1        260   T20  2017
2        413    WC  2018

In [27]:
df['Random'] = df.Year / df.Bestscore
df

   Bestscore India  Year    Random
0        626  Test  2019  3.225240
1        260   T20  2017  7.757692
2        413    WC  2018  4.886199

In [31]:
df['Serie_aligned'] = pd.Series(range(4), index=[0,1,2, 3])
df

   Bestscore India  Year    Random  Serie_aligned
0        626  Test  2019  3.225240              0
1        260   T20  2017  7.757692              1
2        413    WC  2018  4.886199              2

In [29]:
df.to_dict()

{'Bestscore': {0: 626, 1: 260, 2: 413},
 'India': {0: 'Test', 1: 'T20', 2: 'WC'},
 'Year': {0: 2019, 1: 2017, 2: 2018},
 'Random': {0: 3.2252396166134187, 1: 7.757692307692308, 2: 4.886198547215496},
 'Serie_aligned': {0: 0, 1: 1, 2: 2}}

In [30]:
pd.DataFrame(df.to_dict())

   Bestscore India  Year    Random  Serie_aligned
0        626  Test  2019  3.225240              0
1        260   T20  2017  7.757692              1
2        413    WC  2018  4.886199              2

In [33]:
data = [{'a': i, 'b':5* i}for i in range(10)]
print(data)
pd.DataFrame(data)

[{'a': 0, 'b': 0}, {'a': 1, 'b': 5}, {'a': 2, 'b': 10}, {'a': 3, 'b': 15}, {'a': 4, 'b': 20}, {'a': 5, 'b': 25}, {'a': 6, 'b': 30}, {'a': 7, 'b': 35}, {'a': 8, 'b': 40}, {'a': 9, 'b': 45}]

   a   b
0  0   0
1  1   5
2  2  10
3  3  15
4  4  20
5  5  25
6  6  30
7  7  35
8  8  40
9  9  45

In [34]:
pd.DataFrame([{'aa': 1, 'bb': 2}, {'bb': 3, 'cc': 6}])

    aa  bb   cc
0  1.0   2  NaN
1  NaN   3  6.0

In [49]:
pd.DataFrame(np.random.randint(0,10),
            columns=['T20','Test'],
            index=['b','c','d'])

   T20  Test
b    7     7
c    7     7
d    7     7

In [50]:
int=pd.Index([30,20,10,40])
int

Int64Index([30, 20, 10, 40], dtype='int64')

In [52]:
print(int.size, int.shape, int.ndim, int.dtype)

4 (4,) 1 int64

In [54]:
rng = np.random.RandomState(20)
sr = pd.Series(rng.randint(0, 11, 14))
sr

0      3
1     10
2     10
3      9
4      4
5      6
6      7
7      2
8      0
9      6
10     8
11     5
12    10
13    10
dtype: int32

In [61]:
dfr = pd.DataFrame(rng.randint(0, 10, (5, 4)),
                  columns=['A', 'B', 'C', 'D'])
dfr

   A  B  C  D
0  2  8  0  6
1  8  6  1  8
2  3  5  2  5
3  8  7  0  3
4  0  2  0  1

In [62]:
qualifier1=pd.Series({'SRH':195,'RCB':190,'CSK':200}, name='qualifier1')
qualifier2=pd.Series({'KKR':175,'RR':170,'DD':173}, name='qualifier2')

print(qualifier1)
print(qualifier2)

SRH    195
RCB    190
CSK    200
Name: qualifier1, dtype: int64
KKR    175
RR     170
DD     173
Name: qualifier2, dtype: int64

In [63]:
qualifier1/qualifier2

CSK   NaN
DD    NaN
KKR   NaN
RCB   NaN
RR    NaN
SRH   NaN
dtype: float64

In [64]:
qualifier1.index | qualifier2.index

Index(['CSK', 'DD', 'KKR', 'RCB', 'RR', 'SRH'], dtype='object')

In [65]:
AA = pd.Series([12, 54, 66], index=[0, 1, 2])
BB = pd.Series([91, 83, 75], index=[1, 2, 3])
print(AA)
print(BB)
BB
AA + BB

0    12
1    54
2    66
dtype: int64
1    91
2    83
3    75
dtype: int64

0      NaN
1    145.0
2    149.0
3      NaN
dtype: float64

In [66]:
AA.add(BB, fill_value=0)

0     12.0
1    145.0
2    149.0
3     75.0
dtype: float64

In [67]:
df

   Bestscore India  Year    Random  Serie_aligned
0        626  Test  2019  3.225240              0
1        260   T20  2017  7.757692              1
2        413    WC  2018  4.886199              2

In [74]:
df2=pd.DataFrame({"India":["Test","T20","WC"],"Year":["2019","2018","2017"],"Bestscore":[626,260,413]})
df2

  India  Year  Bestscore
0  Test  2019        626
1   T20  2018        260
2    WC  2017        413

In [ ]:
df.merge(df2)